## 需求分析

### 客户管理

**字段：**申请人、身份证号/组织机构代码（或统一信用代码）【个人用身份证】、地址、邮编、联系人（公司级考虑）、固话、手机。

**备注：**相应增删查改功能；客户信息可以共用，以免系统客户信息冗余。

Tips:申请人为Text文本。下拉框选择公司、个人。申请人、身份证、手机是必填项。

### 订单管理-市场部

**字段：**序号（自动生成）、申请名称、申请人（客户管理里面选择）、类型（商标、专利、版权、其他；如果类型是专利则要增加是否减缓字段）、发票信息、收据信息、处理限期（设定该订单任务下一步需要处理的日期）、下一步责任人【部门+责任人名字】（市场部制定给专利编制人；必填）、备注、时间（录入订单时间系统自动生成）。

**备注：**专利分为发明、实用新型、外观设计。

Tips:只有市场部的人有权限生成订单。申请名称、发票信息、收据信息为Text文本。处理限期是日历下拉。下一步责任人是权限为级联部门+人名的下拉菜单。申请名称、申请人、类型、处理期限、下一步责任人为必填项。

### 任务处理-专利编制人

**字段：**压缩包名称（公司内部规则，自己填写）、处理限期（设定该任务下一步需要处理的日期）、下一步责任人（专利编制人制定给流程部；必填）。

### 流程部-主要和产权局打交道

**字段：**登记任务申请日（自行填写计算期限用）。

**备注：**等待期。与产权局沟通。

**字段：**申请号、处理限期（设定该任务下一步需要处理的日期）、下一步责任人（流程部人制定给财务；必填）

### 财务缴费

**字段：**确认是否收费、是否减缓、是否已开票、处理限期（设定该任务下一步需要处理的日期 无日期 流程部等待期）、下一步责任人（财务部人制定给流程部；必填）、备注

Tips:都要必填

**备注：**点击确认是否缴费【暂时不管】

### 流程部

**字段：**登记发文日、处理限期（设定该任务下一步需要处理的日期）、下一步责任人（流程部人制定给财务或任务处理；必填）

**备注：**如果继续给到任务处理，新增一条压缩包数据

财务交完最后一笔款，流程显示完结，所有参与人都可以看到任务已完成。

流程部对于已完成的任务进行文件是否收寄、登记授权公告日、补贴是否申请、明确前补贴还是后补贴，一年时间内要跟进将补贴完成。前补贴以申请日一年内、后补贴以收到证书日起登记授权公告日为准。

### 报表

统计每个客户在公司申请的商标、专利数量。点击客户名称可以直接查看到所有商标专利具体事项。

### 权限管理

- 上下级权限管理即创建人上级可以查看下级所有人员创建资料；
- 业务人员信息只有业务人员自己可以查看，或者业务人员创建任务后，任务的当前处理人以及之前处理过的人员可以查看;
- 创建人、专利负责人、专利工程师离职信息处理法则。
